package zingg.similarity.function;

import java.util.Arrays;

import org.junit.jupiter.api.Test;

import com.wcohen.ss.MongeElkan;

public class TestSAffineGap {
	
	
	public static class MyComparator implements java.util.Comparator<String> {

	    public int compare(String s1, String s2) {
	        return (s1.length() - s2.length())*-1;
	    }
	}

	
	@Test
	public void testStop() {
		String[] stop1 = "益阳,丽水,晋城,银川,安康,大同,通化,滨州,大理白族自治州,资阳,文山壮族苗族自治州,衡阳,威海,伊犁哈萨克自治州,吉安,濮阳,鄂州,新余,鞍山,厦门,凉山彝族自治州,东莞,塔城地区,莆田,思茅,广安,合肥,赣州,海东地区,黔东南苗族侗族自治州,郑州,那曲地区,佳木斯,崇左,泸州,常德,乐山,惠州,阿拉善盟,泉州,许昌,阜阳,临沂,玉林,哈密地区,松原,岳阳,遂宁,桂林,双鸭山,牡丹江,娄底,绍兴,广元,茂名,扬州,商洛,七台河,朔州,石嘴山,蚌埠,十堰,山南地区,巴音郭楞蒙古自治州,淮北,林芝地区,永州,自贡,河源,防城港,南宁,西双版纳傣族自治州,果洛藏族自治州,六盘水,榆林,伊春,博尔塔拉蒙古自治州,洛阳,吴忠,晋中,怒江傈僳族自治州,咸阳,河池,汕头,九江,开封,大庆,荆门,铁岭,长春,东营,马鞍山,遵义,眉山,芜湖,营口,清远,青岛,信阳,柳州,绵阳,聊城,神农架,阳江,黔南布依族苗族自治州,朝阳,安阳,丽江,潍坊,贺州,韶关,淮南,鹰潭,成都,烟台,平顶山,枣庄,白山,葫芦岛,锡林郭勒盟,运城,杭州,黄山,镇江,阿勒泰地区,淮安,庆阳,甘孜藏族自治州,江门,株洲,天水,张掖,固原,衡水,西安,廊坊,和田地区,大连,中卫,南昌,延安,云浮,盘锦,济宁,深圳,甘南藏族自治州,呼和浩特,贵阳,沧州,丹东,白城,克孜勒苏柯尔克孜自治州,贵港,玉树藏族自治州,梧州,海西蒙古族藏族自治州,雅安,台州,德州,常州,孝感,驻马店,兴安盟,武汉,襄樊,巴彦淖尔,温州,乌鲁木齐,楚雄彝族自治州,鄂尔多斯,湛江,承德,临沧,三亚,渭南,邵阳,鸡西,嘉兴,萍乡,赤峰,呼伦贝尔,乌海,北海,吐鲁番地区,阳泉,新乡,咸宁,福州,佛山,内江,邢台,长治,钦州,泰州,汕尾,徐州,舟山,黔西南布依族苗族自治州,齐齐哈尔,莱芜,沈阳,金昌,黑河,拉萨,苏州,怀化,巢湖,宿迁,宝鸡,酒泉,克拉玛依,四平,昌吉回族自治州,大兴安岭地区,绥化,连云港,天津,阿坝藏族羌族自治州,秦皇岛,宜昌,红河哈尼族彝族自治州,海南藏族自治州,焦作,恩施土家族苗族自治州,唐山,阿里地区,宿州,吉林,张家口,无锡,鹤壁,漯河,迪庆藏族自治州,昆明,南通,金华,保定,乌兰察布,包头,珠海,辽源,南充,日喀则地区,盐城,本溪,南京,济南,保山,上海,百色,宁波,昌都地区,石家庄,喀什地区,铜仁地区,铜陵,随州,哈尔滨,延边朝鲜族自治州,亳州,抚州,南阳,上饶,衢州,湘西土家族苗族自治州,中山,六安,攀枝花,曲靖,汉中,宣城,毕节地区,商丘,周口,郴州,三明,黄石,忻州,梅州,黄冈,阿克苏地区,海口,淄博,长沙,陇南,广州,荆州,滁州,宁德,张家界,通辽,宜春,白银,鹤岗,龙岩,重庆,日照,来宾,湖州,临夏回族自治州,玉溪,阜新,定西,铜川,海北藏族自治州,漳州,锦州,黄南藏族自治州,肇庆,兰州,武威,湘潭,三门峡,德宏傣族景颇族自治州,德阳,抚顺,安庆,池州,辽阳,荷泽,揭阳,潮州,安顺,北京,泰安,宜宾,太原,邯郸,昭通,西宁,临汾,平凉,景德镇,巴中,吕梁,南平,达州,益陽,麗水,晉城,銀川,安康,大同,通化,濱州,大理白族自治州,資陽,文山壯族苗族自治州,衡陽,威海,伊犁哈薩克自治州,吉安,濮陽,鄂州,新余,鞍山,廈門,涼山彝族自治州,東莞,塔城地區,莆田,思茅,廣安,合肥,贛州,海東地區,黔東南苗族侗族自治州,鄭州,那曲地區,佳木斯,崇左,瀘州,常德,樂山,惠州,阿拉善盟,泉州,許昌,阜陽,臨沂,玉林,哈密​​地區,松原,岳陽,遂寧,桂林,雙鴨山,牡丹江,婁底,紹興,廣元,茂名,揚州,商洛,七台河,朔州,石嘴山,蚌埠,十堰,山南地區,巴音郭楞蒙古自治州,淮北,林芝地區,永州,自貢,河源,防城港,南寧,西雙版納傣族自治州,果洛藏族自治州,六盤水,榆林,伊春,博爾塔拉蒙古自治州,洛陽,吳忠,晉中,怒江傈僳族自治州,咸陽,河池,汕頭,九江,開封,大慶,荊門,鐵嶺,長春,東營,馬鞍山,遵義,眉山,蕪湖,營口,清遠,青島,信陽,柳州,綿陽,聊城,神農架,陽江,黔南布依族苗族自治州,朝陽,安陽,麗江,濰坊,賀州,韶關,淮南,鷹潭,成都,煙台,平頂山,棗莊,白山,葫蘆島,錫林郭勒盟,運城,杭州,黃山,鎮江,阿勒泰地區,淮安,慶陽,甘孜藏族自治州,江門,株洲,天水,張掖,固原,衡水,西安,廊坊,和田地區,大連,中衛,南昌,延安,雲浮,盤錦,濟寧,深圳,甘南藏族自治州,呼和浩特,貴陽,滄州,丹東,白城,克孜勒蘇柯爾克孜自治州,貴港,玉樹藏族自治州,梧州,海西蒙古族藏族自治州,雅安,台州,德州,常州,孝感,駐馬店,興安盟,武漢,襄樊,巴彥淖爾,溫州,烏魯木齊,楚雄彝族自治州,鄂爾多斯,湛江,承德,臨滄,三亞,渭南,邵陽,雞西,嘉興,萍鄉,赤峰,呼倫貝爾,烏海,北海,吐魯番地區,陽泉,新鄉,咸寧,福州,佛山,內江,邢台,長治,欽州,泰州,汕尾,徐州,舟山,黔西南布依族苗族自治州,齊齊哈爾,萊蕪,瀋陽,金昌,黑河,拉薩,蘇州,懷化,巢湖,宿遷,寶雞,酒泉,克拉瑪依,四平,昌吉回族自治州,大興安嶺地區,綏化,連雲港,天津,阿壩藏族羌族自治州,秦皇島,宜昌,紅河哈尼族彝族自治州,海南藏族自治州,焦作,恩施土家族苗族自治州,唐山,阿里地區,宿州,吉林,張家口,無錫,鶴壁,漯河,迪慶藏族自治州,昆明,南通,金華,保定,烏蘭察布,包頭,珠海,遼源,南充,日喀則地區,鹽城,本溪,南京,濟南,保山,上海,百色,寧波,昌都地區,石家莊,喀什地區,銅仁地區,銅陵,隨州,哈爾濱,延邊朝鮮族自治州,亳州,撫州,南陽,上饒,衢州,湘西土家族苗族自治州,中山,六安,攀枝花,曲靖,漢中,宣城,畢節地區,商丘,周口,郴州,三明,黃石,忻州,梅州,黃岡,阿克蘇地區,海口,淄博,長沙,隴南,廣州,荊州,滁州,寧德,張家界,通遼,宜春,白銀,鶴崗,龍巖,重慶,日照,來賓,湖州,臨夏回族自治州,玉溪,阜新,定西,銅川,海北藏族自治州,漳州,錦州,黃南藏族自治州,肇慶,蘭州,武威,湘潭,三門峽,德宏傣族景頗族自治州,德陽,撫順,安慶,池州,遼陽,荷澤,揭陽,潮州,安順,北京,泰安,宜賓,太原,邯鄲,昭通,西寧,臨汾,平涼,景德鎮,巴中,呂梁,南平,達州,有限公司,厂,廠,大学,大學,国际,國際,贸易,貿易,科技,贵州省,湖南省,云南省,内蒙古自治区,黑龙江省,广西壮族自治区,江苏省,重庆市,北京市,福建省,天津市,湖北省,江西省,陕西省,甘肃省,辽宁省,青海省,广东省,海南省,四川省,吉林省,山西省,安徽省,河南省,新疆维吾尔自治区,浙江省,宁夏回族自治区,河北省,山东省,西藏自治区,上海市,貴州省,湖南省,雲南省,內蒙古自治區,黑龍江省,廣西壯族自治區,江蘇省,重慶市,北京市,福建省,天津市,湖北省,江西省,陝西省,甘肅省,遼寧省,青海省,廣東省,海南省,四川省,吉林省,山西省,安徽省,河南省,新疆維吾爾自治區,浙江省,寧夏回族自治區,河北省,山東省,西藏自治區,上海市,食品,集团,集團,股份,生物,进出口,進出口,工程,中心,协会,協會,有限,公司,技术,技術,商贸,商貿".split(",");
		/*String test = "上海度刊国际贸易有限公司";
		for (String s: stop1) {
			String test1 = test.replace(s, "");
			if (!test1.equals(test)) {
				System.out.println("Original " + test + " and new " + test1 );
			}
			test = test1;
		}*/
		String test = "上海添然食品添加剂有限公司";
		System.out.println("Sorting");
		Arrays.sort(stop1, new MyComparator());
		test = "上海度刊国际贸易有限公司";
		for (String s: stop1) {
			String test1 = test.replace(s, "");
			if (!test1.equals(test)) {
				System.out.println("Original " + test + " and new " + test1 );
			}
			test = test1;
		}
		/*
		test = "上海麦科餐饮管理有限公司"; //"上海秀爱国际贸易有限公司";
		for (String s: stop1) {
			String test1 = test.replace(s, "");
			if (!test1.equals(test)) {
				System.out.println("Original " + test + " and new " + test1 );
			}
			test = test1;
		}
		*/
		System.out.println("Sorting");
		Arrays.sort(stop1, new MyComparator());
		test = "上海麦科餐饮管理有限公司"; //"上海秀爱国际贸易有限公司";
		for (String s: stop1) {
			String test1 = test.replace(s, "");
			if (!test1.equals(test)) {
				System.out.println("Original " + test + " and new " + test1 );
			}
			test = test1;
		}		
		
	}

}
